Autodesk.Revit.DB.ArcLengthDimension.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.Arc,Autodesk.Revit.DB.Reference,System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
Creates a new instance of an Arc Length Dimension element within the project.
document:
The document where the new Arc Length Dimension is created.
dbView:
The view in which the Arc Length Dimension will appear.
arc:
The Arc of the annotation itself
ArcRef:
Reference for the arc to be measured
references:
The segments which the Arc Length Dimension will witness.
Returns:
The newly created Arc Length Dimension instance, or null if the operation fails.
Throws Autodesk.Revit.Exceptions.ArgumentException:
References should be: at least two and intersecting the ends of the arc passed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2025

Autodesk.Revit.DB.ArcLengthDimension
An object that represents an ArcLengthDimension within the Revit Project.
Since:
2025